#include <stdio.h>

int main() {

    int n = 0 ;
    int i = 0 ; 
    int j = 0 ;

    printf( "Enter Number : " ) ;
    if(scanf("%d", &n) != 1){
        printf( "ให้กรอกเฉพาะตัวเลขเท่านั้น\n" ) ;
        return 0 ;
    }

    if ( n < 2 ) {
        printf( "ไม่มีจำนวนเฉพาะในช่วง 1 ถึง %d\n" , n ) ;
        return 0;
    }

    printf( "จำนวนเฉพาะ : " );
    i = n;
    while (i >= 2)                   
    {
        j = 2 ;                      // ตรวจทุกจำนวนจาก n ถึง 2 (2 เป็นจำนวนเฉพาะตัวแรก)
        while ( j < i)               // วนจนกว่า j จะเท่ากับ i (ตรวจว่ามีตัวหารอื่นไหมนอกจาก 1 กับตัวมันเอง)
        {
            if ( i % j == 0 ){
                break ;              // ถ้าเจอตัวหารอื่นแล้วให้หยุดตรวจ (ไม่ใช่จำนวนเฉพาะ)
            }//end if
            j++ ;
        }

        if ( j == i ){              // ถ้าไม่มีตัวหารอื่นนอกจากตัวมันเองคือจำนวนเฉพาะ
            printf( "%d " , i ) ;   // แสดงจำนวน i ของแต่ละรอบ
        }//end if
        i-- ;                       // ลดค่าของ i ลง 1 เพื่อไปตรวจจำนวนถัดไป
    }

    printf( "\n" ) ;
    return 0 ;
}//end main
