#include <stdio.h>

int main() {

    int n = 0 ;     // รับค่าจากผู้ใช้
    int i = 0 ;     // ตัวนับลูป1
    int j = 0 ;     // ตัวนับลูป2

    printf( "Enter Number : " ) ;
    if(scanf("%d", &n) != 1){
        printf( "ให้กรอกเฉพาะตัวเลขเท่านั้น\n" ) ;
        return 0 ;
    }

    if ( n < 2 ) {
        printf( "ไม่มีจำนวนเฉพาะในช่วง 1 ถึง %d\n" , n ) ;
        return 0;
    }

    printf( "จำนวนเฉพาะ : " );
    for (i = n; i >= 2; i--) {           // ตรวจทุกจำนวนจาก n ถึง 2 (*2 เป็นจำนวนเฉพาะตัวแรก)

        //printf( "ตรวจ %d : " , i ) ;

        for ( j = 2; j < i; j++ ){       // ตรวจว่ามีตัวหารอื่นไหมนอกจาก 1 กับตัวมันเอง (*ถ้ากำหนด j = 1 ทุกตัวจะเป็นจำนวนเฉพาะ)
            if ( i % j == 0 ){
                break ;                  //ถ้าเจอตัวหารอื่นแล้วให้หยุดตรวจ
            }//end if
        }//end for

        if ( j == i ){                   //ถ้าไม่มีตัวหารอื่นนอกจากตัวมันเองคือจำนวนเฉพาะ
            printf( "%d " , i ) ;   
        }//end if

    }//end for

    printf( "\n" ) ;
    return 0 ;
}//end main
